/*
Напишите программу, которая будет принимать на вход несколько аргументов:
дату и время в формате «час-день-месяц-год».

Задача программы — создавать для каждого аргумента таймер с обратным отсчётом:
посекундный вывод в терминал состояния таймеров (сколько осталось).

По истечении какого-либо таймера, вместо сообщения о том, сколько осталось,
требуется показать сообщение о завершении его работы.

Важно, чтобы работа программы основывалась на событиях.
*/

'use strict'

const Counter = require('./counter')

function init() {
  const argv = process.argv
  for (let index = 2; index < argv.length; index++) {
    const end_at = argv[index]
    new Counter(end_at).start()
  }
}

init()
